node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "img_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
        tensor_content: ")\\\367B\331\216\351B\305\340\317B"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "Placeholder"
  input: "img_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v1_101/Pad"
  op: "Pad"
  input: "sub"
  input: "resnet_v1_101/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.13299275934696198
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/mul"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/conv1/weights"
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/conv1/weights"
}
node {
  name: "resnet_v1_101/conv1/weights/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/conv1/weights"
  input: "resnet_v1_101/conv1/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/scale"
  input: "resnet_v1_101/conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/Conv2D"
  op: "Conv2D"
  input: "resnet_v1_101/Pad"
  input: "resnet_v1_101/conv1/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/conv1/BatchNorm/gamma"
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/conv1/BatchNorm/gamma"
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/gamma"
  input: "resnet_v1_101/conv1/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/conv1/BatchNorm/beta"
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/conv1/BatchNorm/beta"
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/beta"
  input: "resnet_v1_101/conv1/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/conv1/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_mean"
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_mean"
  input: "resnet_v1_101/conv1/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/conv1/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_variance"
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_variance"
  input: "resnet_v1_101/conv1/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "resnet_v1_101/conv1/Conv2D"
  input: "resnet_v1_101/conv1/BatchNorm/ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/ReadVariableOp_1"
  input: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_101/conv1/Relu"
  op: "Relu"
  input: "resnet_v1_101/conv1/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/pool1/MaxPool"
  op: "MaxPool"
  input: "resnet_v1_101/conv1/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000@\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20155644416809082
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/scale"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/Conv2D"
  op: "Conv2D"
  input: "resnet_v1_101/pool1/MaxPool"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/Conv2D"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/ReadVariableOp_1"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20155644416809082
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/scale"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/Conv2D"
  op: "Conv2D"
  input: "resnet_v1_101/pool1/MaxPool"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resnet_v1_101/block1/unit_1/bottleneck_v1/conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
